fio/ceph-file-layout/bs_su512k_o4m/randr_s1m_j128.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 128 threads

randr: (groupid=0, jobs=128): err= 0: pid=1662: Thu Feb 20 13:23:12 2020
  read: IOPS=38.4k, BW=300MiB/s (315MB/s)(87.0GiB/300014msec)
    slat (usec): min=29, max=19116, avg=2492.76, stdev=2163.93
    clat (nsec): min=621, max=286570k, avg=834680.09, stdev=1492664.14
     lat (usec): min=449, max=291019, avg=3327.78, stdev=2641.93
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[  523], 10.00th=[  578], 20.00th=[  627],
     | 30.00th=[  668], 40.00th=[  701], 50.00th=[  734], 60.00th=[  775],
     | 70.00th=[  824], 80.00th=[  898], 90.00th=[ 1057], 95.00th=[ 1254],
     | 99.00th=[ 3032], 99.50th=[ 4178], 99.90th=[ 6849], 99.95th=[26084],
     | 99.99th=[73925]
   bw (  KiB/s): min=200944, max=490448, per=100.00%, avg=307914.69, stdev=397.59, samples=76544
   iops        : min=25120, max=61306, avg=38489.23, stdev=49.70, samples=76544
  lat (nsec)   : 750=0.01%, 1000=0.02%
  lat (usec)   : 2=0.73%, 4=1.13%, 10=0.09%, 20=0.02%, 50=0.10%
  lat (usec)   : 100=0.27%, 250=0.71%, 500=1.22%, 750=49.89%, 1000=33.59%
  lat (msec)   : 2=10.54%, 4=1.11%, 10=0.49%, 20=0.02%, 50=0.03%
  lat (msec)   : 100=0.02%, 250=0.01%, 500=0.01%
  cpu          : usr=0.12%, sys=25.49%, ctx=33201921, majf=0, minf=79130
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=11530914,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=300MiB/s (315MB/s), 300MiB/s-300MiB/s (315MB/s-315MB/s), io=87.0GiB (94.5GB), run=300014-300014msec