fio/ceph-file-layout/bs_su512k_o4m/randr_s2g_j1.out
randr: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=1
fio-3.18
Starting 1 thread

randr: (groupid=0, jobs=1): err= 0: pid=54043: Wed Feb 19 17:43:03 2020
  read: IOPS=754, BW=6039KiB/s (6184kB/s)(1769MiB/300008msec)
    slat (usec): min=27, max=214, avg=42.60, stdev= 3.85
    clat (usec): min=352, max=254377, avg=1280.95, stdev=3425.26
     lat (usec): min=392, max=254416, avg=1323.68, stdev=3425.36
    clat percentiles (usec):
     |  1.00th=[   474],  5.00th=[   529], 10.00th=[   553], 20.00th=[   578],
     | 30.00th=[   603], 40.00th=[   619], 50.00th=[   644], 60.00th=[   660],
     | 70.00th=[   685], 80.00th=[   725], 90.00th=[   799], 95.00th=[  2999],
     | 99.00th=[ 17433], 99.50th=[ 19006], 99.90th=[ 23462], 99.95th=[ 36439],
     | 99.99th=[105382]
   bw (  KiB/s): min= 1056, max=11904, per=100.00%, avg=6042.40, stdev=4249.83, samples=599
   iops        : min=  132, max= 1488, avg=755.30, stdev=531.23, samples=599
  lat (usec)   : 500=2.27%, 750=83.08%, 1000=8.45%
  lat (msec)   : 2=0.77%, 4=0.75%, 10=1.44%, 20=2.96%, 50=0.23%
  lat (msec)   : 100=0.02%, 250=0.01%, 500=0.01%
  cpu          : usr=0.25%, sys=2.41%, ctx=452882, majf=0, minf=115
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=226453,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=6039KiB/s (6184kB/s), 6039KiB/s-6039KiB/s (6184kB/s-6184kB/s), io=1769MiB (1855MB), run=300008-300008msec