fio/ceph-file-layout/bs_su512k_o4m/seqw_s1m_j2.out
seqw: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 2 threads

seqw: (groupid=0, jobs=2): err= 0: pid=968: Thu Feb 20 13:12:02 2020
  write: IOPS=1440, BW=90.0MiB/s (94.4MB/s)(26.4GiB/300235msec)
    slat (usec): min=25, max=272, avg=33.22, stdev= 4.96
    clat (usec): min=783, max=728651, avg=1353.69, stdev=7885.18
     lat (usec): min=820, max=728682, avg=1387.05, stdev=7885.15
    clat percentiles (usec):
     |  1.00th=[   881],  5.00th=[   922], 10.00th=[   947], 20.00th=[   971],
     | 30.00th=[   996], 40.00th=[  1012], 50.00th=[  1029], 60.00th=[  1057],
     | 70.00th=[  1090], 80.00th=[  1139], 90.00th=[  1270], 95.00th=[  1467],
     | 99.00th=[  4228], 99.50th=[  4883], 99.90th=[ 42206], 99.95th=[185598],
     | 99.99th=[387974]
   bw (  KiB/s): min=11264, max=118272, per=100.00%, avg=92631.74, stdev=16565.85, samples=1194
   iops        : min=  176, max= 1848, avg=1447.37, stdev=258.84, samples=1194
  lat (usec)   : 1000=33.01%
  lat (msec)   : 2=63.33%, 4=2.49%, 10=1.02%, 20=0.02%, 50=0.05%
  lat (msec)   : 100=0.02%, 250=0.03%, 500=0.03%, 750=0.01%
  cpu          : usr=0.34%, sys=2.39%, ctx=434977, majf=0, minf=308
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,432531,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=90.0MiB/s (94.4MB/s), 90.0MiB/s-90.0MiB/s (94.4MB/s-94.4MB/s), io=26.4GiB (28.3GB), run=300235-300235msec