fio/ceph-file-layout/bs_su512k_o4m/seqw_s2g_j16.out
seqw: (g=0): rw=write, bs=(R) 64.0KiB-64.0KiB, (W) 64.0KiB-64.0KiB, (T) 64.0KiB-64.0KiB, ioengine=libaio, iodepth=1
...
fio-3.18
Starting 16 threads

seqw: (groupid=0, jobs=16): err= 0: pid=71799: Wed Feb 19 21:48:31 2020
  write: IOPS=7143, BW=446MiB/s (468MB/s)(131GiB/300004msec)
    slat (usec): min=21, max=1082, avg=91.96, stdev=30.67
    clat (usec): min=295, max=112010, avg=2146.02, stdev=2165.32
     lat (usec): min=822, max=112119, avg=2238.19, stdev=2165.93
    clat percentiles (usec):
     |  1.00th=[  979],  5.00th=[ 1090], 10.00th=[ 1156], 20.00th=[ 1254],
     | 30.00th=[ 1336], 40.00th=[ 1418], 50.00th=[ 1532], 60.00th=[ 1663],
     | 70.00th=[ 1844], 80.00th=[ 2343], 90.00th=[ 4555], 95.00th=[ 5211],
     | 99.00th=[ 6652], 99.50th=[ 8717], 99.90th=[29492], 99.95th=[49021],
     | 99.99th=[65274]
   bw (  KiB/s): min=295552, max=538752, per=100.00%, avg=457673.84, stdev=2318.87, samples=9584
   iops        : min= 4618, max= 8418, avg=7151.14, stdev=36.23, samples=9584
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=1.43%
  lat (msec)   : 2=73.75%, 4=11.06%, 10=13.38%, 20=0.24%, 50=0.10%
  lat (msec)   : 100=0.05%, 250=0.01%
  cpu          : usr=0.18%, sys=2.26%, ctx=4023829, majf=0, minf=69147
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2142934,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=446MiB/s (468MB/s), 446MiB/s-446MiB/s (468MB/s-468MB/s), io=131GiB (140GB), run=300004-300004msec